In [2]:
# 07중간고사대비실습2
import pandas as pd

In [4]:
fName="health_data.csv"
df = pd.read_csv(fName) # encoding="cp949"
df

    코드번호 성별    키  체중    BMI  수축기  이완기
0  33001  남  175  65  21.22  143  110
1  34037  여  165  52  19.10  119   78
2  35123  여  159  67  26.50  130   83

In [5]:
# 6.성명으로 열 추가하기 (추가내용: "이순신","선덕여왕","명성황후")
df["성명"] = ["이순신","선덕여왕","명성황후"]
df

    코드번호 성별    키  체중    BMI  수축기  이완기    성명
0  33001  남  175  65  21.22  143  110   이순신
1  34037  여  165  52  19.10  119   78  선덕여왕
2  35123  여  159  67  26.50  130   83  명성황후

In [6]:
# 7.코드번호 열 삭제하기(axis,inplace 옵션 사용하기)
df.drop("코드번호", axis=1, inplace=True)
df

  성별    키  체중    BMI  수축기  이완기    성명
0  남  175  65  21.22  143  110   이순신
1  여  165  52  19.10  119   78  선덕여왕
2  여  159  67  26.50  130   83  명성황후

In [7]:
# 8.성명을 인덱스로 지정하기
# (원본 수정되도록 옵션 inplace 넣기)
df.set_index("성명",inplace=True)
df

     성별    키  체중    BMI  수축기  이완기
성명
이순신   남  175  65  21.22  143  110
선덕여왕  여  165  52  19.10  119   78
명성황후  여  159  67  26.50  130   83

In [8]:
# 9. 선덕여왕의 BMI를 20.00 으로 수정하기
df.loc["선덕여왕","BMI"] = 20.00
df

     성별    키  체중    BMI  수축기  이완기
성명
이순신   남  175  65  21.22  143  110
선덕여왕  여  165  52  20.00  119   78
명성황후  여  159  67  26.50  130   83

In [9]:
# 10. '성별' 열의 고유값 개수 확인하기
df["성별"].value_counts()

여    2
남    1
Name: 성별, dtype: int64